[
  {
    "id": 1,
    "name": "Apple iPhone 16 Pro",
    "category": "Smartphone",
    "brand": "Apple",
    "price": 999,
    "currency": "USD",
    "rating": 4.8,
    "stock": 25,
    "description": "The Apple iPhone 16 Pro is the latest flagship smartphone featuring the powerful A17 Bionic chip for lightning-fast performance. It comes with a stunning 6.1-inch Super Retina XDR display with ProMotion technology, delivering a smooth 120Hz refresh rate. The advanced triple-camera system includes a 48MP primary sensor, offering exceptional low-light photography and 8K video recording capabilities. With improved battery life, MagSafe compatibility, and iOS 18, the iPhone 16 Pro is a premium choice for tech enthusiasts.",
    "image": "/assets/images/iphone16pro.png"
  },
  {
    "id": 2,
    "name": "Samsung Galaxy S25 Ultra",
    "category": "Smartphone",
    "brand": "Samsung",
    "price": 1199,
    "currency": "USD",
    "rating": 4.7,
    "stock": 30,
    "description": "The Samsung Galaxy S25 Ultra is a cutting-edge flagship smartphone with a massive 6.8-inch Dynamic AMOLED 2X display, boasting a 120Hz refresh rate and HDR10+ support. Equipped with a 200MP primary camera and periscope zoom lens, it delivers unparalleled photography and 100x Space Zoom. Powered by the latest Snapdragon 8 Gen 3 processor and a 5000mAh battery with 65W fast charging, this phone is built for performance. The S-Pen integration and AI-driven One UI make multitasking effortless.",
    "image": "/assets/images/s25ultra.png"
  },
  {
    "id": 3,
    "name": "Sony WH-1000XM5",
    "category": "Headphones",
    "brand": "Sony",
    "price": 399,
    "currency": "USD",
    "rating": 4.9,
    "stock": 50,
    "description": "The Sony WH-1000XM5 is an industry-leading noise-canceling wireless headphone designed for audiophiles and frequent travelers. Featuring Sony’s advanced noise-canceling technology with dual processors, it effectively blocks out external noise for an immersive listening experience. The lightweight design and plush ear cushions ensure long-lasting comfort, while the 30-hour battery life with quick charging makes it perfect for on-the-go use. With support for Hi-Res Audio, LDAC, and multipoint connectivity, these headphones offer superior sound quality and convenience.",
    "image": "/assets/images/sonywh1000xm5.png"
  },
  {
    "id": 4,
    "name": "Apple MacBook Pro 16-inch",
    "category": "Laptop",
    "brand": "Apple",
    "price": 2499,
    "currency": "USD",
    "rating": 4.8,
    "stock": 15,
    "description": "The Apple MacBook Pro 16-inch is a powerhouse laptop designed for professionals and creatives. Featuring Apple’s latest M3 Max chip, it delivers unprecedented speed and efficiency for demanding tasks like 4K video editing, 3D rendering, and app development. The Liquid Retina XDR display offers stunning brightness and color accuracy, while the 32GB RAM and 1TB SSD ensure seamless multitasking. With an all-day battery life, an improved Magic Keyboard, and an enhanced six-speaker sound system, this MacBook Pro redefines productivity.",
    "image": "/assets/images/macbookpro.png"
  },
  {
    "id": 5,
    "name": "Dell XPS 15",
    "category": "Laptop",
    "brand": "Dell",
    "price": 1899,
    "currency": "USD",
    "rating": 4.7,
    "stock": 20,
    "description": "The Dell XPS 15 is a high-performance laptop designed for professionals and creators. Featuring a stunning 15.6-inch 4K OLED InfinityEdge display, it offers exceptional color accuracy and deep contrast. Powered by an Intel Core i9 processor and NVIDIA RTX 4070 GPU, it delivers blazing-fast performance for gaming and content creation. With a premium aluminum chassis, a large trackpad, and an ergonomic keyboard, the XPS 15 is built for both aesthetics and functionality. Thunderbolt 4 ports and an all-day battery life make it a versatile choice for power users.",
    "image": "/assets/images/dellxps15.png"
  },
  {
    "id": 6,
    "name": "Samsung 55-inch QLED 4K TV",
    "category": "Television",
    "brand": "Samsung",
    "price": 999,
    "currency": "USD",
    "rating": 4.6,
    "stock": 10,
    "description": "Experience cinematic brilliance with the Samsung 55-inch QLED 4K TV. Featuring Quantum Dot technology, it delivers over a billion shades of color with incredible clarity. The Quantum HDR and Dolby Atmos audio ensure an immersive entertainment experience. With Samsung’s Tizen OS, you can access popular streaming services, smart assistants, and a seamless user interface. The ultra-slim design with a near bezel-less display enhances your home decor, while advanced gaming features make it a great choice for console gamers.",
    "image": "/assets/images/samsungqled.png"
  },
  {
    "id": 7,
    "name": "Apple iPad Pro 12.9-inch",
    "category": "Tablet",
    "brand": "Apple",
    "price": 1299,
    "currency": "USD",
    "rating": 4.9,
    "stock": 40,
    "description": "The Apple iPad Pro 12.9-inch is a versatile powerhouse equipped with the M2 chip for blazing-fast performance. The Liquid Retina XDR display delivers true-to-life colors, high brightness, and a 120Hz refresh rate for smooth visuals. With Apple Pencil 2 and Magic Keyboard support, it transforms into a productivity machine for designers, students, and professionals. The 5G connectivity, Face ID security, and all-day battery life make it the ultimate tablet experience.",
    "image": "/assets/images/ipadpro.png"
  },
  {
    "id": 8,
    "name": "Logitech MX Master 3S",
    "category": "Accessories",
    "brand": "Logitech",
    "price": 99,
    "currency": "USD",
    "rating": 4.8,
    "stock": 100,
    "description": "The Logitech MX Master 3S is an ergonomic wireless mouse designed for professionals and power users. Featuring an ultra-fast MagSpeed scroll wheel, it allows seamless navigation across documents and web pages. The precision Darkfield sensor ensures flawless tracking on any surface, including glass. With up to 70 days of battery life and multi-device connectivity, it’s a must-have for efficient workflow. The customizable buttons and ergonomic design provide comfort for long hours of use.",
    "image": "/assets/images/mxmaster3s.png"
  },
  {
    "id": 9,
    "name": "ASUS ROG Strix RTX 4090",
    "category": "PC Components",
    "brand": "ASUS",
    "price": 1999,
    "currency": "USD",
    "rating": 3.9,
    "stock": 5,
    "description": "The ASUS ROG Strix RTX 4090 is the ultimate gaming GPU, engineered for extreme performance and high-end gaming. Featuring 24GB of ultra-fast GDDR6X memory, it delivers unparalleled ray tracing and AI-powered graphics acceleration. With an advanced cooling system, overclocking potential, and support for DLSS 3.0, this GPU ensures smooth 4K and even 8K gaming. Whether you're into competitive eSports, high-fidelity VR, or content creation, the RTX 4090 is designed to handle the most demanding workloads with ease.",
    "image": "/assets/images/asusrtx4090.png"
  },
  {
    "id": 10,
    "name": "Sony PlayStation 5",
    "category": "Gaming Console",
    "brand": "Sony",
    "price": 499,
    "currency": "USD",
    "rating": 4.8,
    "stock": 35,
    "description": "The Sony PlayStation 5 is a next-generation gaming console that redefines immersive gaming with its ultra-fast custom SSD, ray-tracing capabilities, and haptic feedback-enabled DualSense controller. Powered by a cutting-edge AMD Ryzen Zen 2 processor and RDNA 2 GPU, the PS5 delivers stunning 4K visuals at up to 120Hz. With support for 3D audio, an extensive library of exclusive titles, and backward compatibility with PS4 games, the PS5 offers a seamless gaming experience for both casual and hardcore gamers.",
    "image": "/assets/images/ps5.png"
  },
  {
    "id": 11,
    "name": "Samsung Galaxy Tab S9 Ultra",
    "category": "Tablet",
    "brand": "Samsung",
    "price": 1199,
    "currency": "USD",
    "rating": 4.7,
    "stock": 30,
    "description": "The Samsung Galaxy Tab S9 Ultra is a high-performance tablet featuring a stunning 14.6-inch AMOLED display with a 120Hz refresh rate for smooth visuals. Powered by the Snapdragon 8 Gen 2 processor and paired with up to 16GB RAM, this device ensures seamless multitasking and powerful gaming. It supports the S-Pen for precise creativity and productivity, and with its IP68 water and dust resistance, it's built for durability. The Tab S9 Ultra is perfect for professionals, artists, and entertainment lovers alike.",
    "image": "/assets/images/galaxy-tab-s9-ultra.png"
  },
  {
    "id": 12,
    "name": "AirPods Max",
    "category": "Headphones",
    "brand": "Apple",
    "price": 445,
    "currency": "USD",
    "rating": 4.8,
    "stock": 50,
    "description": "Apple's AirPods Max redefine premium sound quality with high-fidelity audio, active noise cancellation, and spatial audio for an immersive listening experience. Featuring a breathable knit mesh headband, memory foam ear cushions, and a sleek aluminum build, these over-ear headphones ensure both style and comfort. With up to 20 hours of battery life, Adaptive EQ, and seamless integration with Apple devices, the AirPods Max offer a luxurious audio experience for audiophiles and Apple enthusiasts.",
    "image": "/assets/images/airpodsmax.png"
  },
  {
    "id": 13,
    "name": "DJI Mini 4 Pro",
    "category": "Drone",
    "brand": "DJI",
    "price": 999,
    "currency": "USD",
    "rating": 4.9,
    "stock": 15,
    "description": "The DJI Mini 4 Pro is an ultra-compact drone with professional-grade features, offering stunning 4K HDR video and intelligent flight modes for cinematic shots. With an extended flight time of up to 45 minutes and a lightweight, foldable design, it's perfect for travelers and content creators. Advanced obstacle sensing, AI-powered subject tracking, and a robust transmission system ensure safe and smooth flights. Whether you're an amateur or a pro, the Mini 4 Pro captures breathtaking aerial footage effortlessly.",
    "image": "/assets/images/dji-mini-4-pro.png"
  },
  {
    "id": 14,
    "name": "Logitech MX Mechanical Keyboard",
    "category": "Keyboard",
    "brand": "Logitech",
    "price": 169,
    "currency": "USD",
    "rating": 4.6,
    "stock": 40,
    "description": "The Logitech MX Mechanical Keyboard combines precision typing with wireless versatility. Designed for productivity, it features tactile mechanical switches for a satisfying keystroke experience. With multi-device connectivity via Bluetooth or USB receiver, you can effortlessly switch between your PC, Mac, and tablet. The backlit keys adapt to ambient lighting, while the long battery life ensures uninterrupted workflow. Perfect for professionals, programmers, and creatives who demand both comfort and performance.",
    "image": "/assets/images/logitech-mx-mechanical.png"
  },
  {
    "id": 15,
    "name": "Asus ROG Strix G16",
    "category": "Gaming Laptop",
    "brand": "Asus",
    "price": 1899,
    "currency": "USD",
    "rating": 4.7,
    "stock": 20,
    "description": "The Asus ROG Strix G16 is a powerhouse gaming laptop designed for high-performance gaming. Equipped with an NVIDIA RTX 4080 GPU, a 13th Gen Intel Core i9 processor, and a 16-inch FHD+ 240Hz display, it delivers ultra-smooth gameplay with vivid visuals. Its advanced cooling system keeps temperatures low during intense gaming sessions, while customizable RGB lighting adds a personal touch. Whether you're a competitive gamer or a content creator, the ROG Strix G16 offers cutting-edge performance and durability.",
    "image": "/assets/images/asus-rog-strix-g16.png"
  }
]
